// Параметры карты
var mapElement  = 'map';
var mapCenter   = [50.8527,40.8664];
var mapZoom     = 8;
var mapControls = ['zoomControl'];

// Параметры маршрута
var routeTitle  = 'Маршрут';
var routeColor  = '#359BEE';
var routeWidth  = 6;
var routeLength = 0;
var routeRatio  = 5.4;
var routePrice  = 0;

// Оформление обычной и выделенной транзитных точек маршрута
var midPointsUnchecked = 'islands#darkGreenCircleIcon';
var midPointsChecked   = 'islands#darkGreenCircleDotIcon';

// Массив транзитных точек маршрута
var routeMidPoints = {
    'выезд из Воронежа в северном направлении'        : [51.7415,39.1827],
    'развязка на Рамонь'                              : [51.9304,39.2209],
    'выезд в направлении Тамбова'                     : [51.6797,39.2880],
    'развязка на Верхнюю Хаву'                        : [51.6896,39.4961],
    'развязка на Панино 1'                            : [51.6892,39.9314],
    'развязка на Терновку 1'                          : [51.7005,40.8943],
    'выезд из города в южном направлении'             : [51.6570,39.2865],
    'развязка на Новую Усмань'                        : [51.6133,39.3827],
    'развязка на Саратов'                             : [51.4963,39.5476],
    'развязка на Панино 2'                            : [51.4672,39.8634],
    'развязка на Бобров 1'                            : [51.4900,40.3950],
    'развязка на Таловую'                             : [51.4929,40.5690],
    'развязка на Эртиль'                              : [51.4504,40.9277],
    'развязка на Терновку 2'                          : [51.4364,41.4283],
    'развязка на Новохопёрск'                         : [51.4164,41.7335],
    'развязка на Грибановский'                        : [51.4375,41.9131],
    'развязка на Поворино'                            : [51.4027,42.0073],
    'развязка Поворино - Новохоперск'                 : [51.2349,42.0987],
    'развязка Лиски - Бобров'                         : [51.1078,39.7440],
    'развязка на Бобров 2'                            : [51.0733,39.8254],
    'развязка на Бобров - Бутурлиновку'               : [51.1016,40.7299],
    'развязка на Урюпинск'                            : [50.9479,42.3278],
    'рязвязка на Бутурлиновку 1'                      : [50.7504,40.0357],
    'развязка на Воробьёвку'                          : [50.7303,41.7625],
    'развязка на Лиски'                               : [50.7985,39.3527],
    'развязка на Ольховатку'                          : [50.4101,39.4000],
    'развязка на Подгоренский'                        : [50.5417,40.0795],
    'развязка на Калач'                               : [50.4509,40.1396],
    'развязка на Бутурлиновку 2'                      : [50.4496,40.1833],
    'развязка на Петропавловку'                       : [50.4231,40.9670],
    'развязка на Ольховатку - Кантемировку'           : [50.2066,39.5104],
    'развязка на Павловск - Подгоренский'             : [50.2139,39.5574],
    'развязка на Россошь 1'                           : [50.0552,40.4615],
    'развязка на Богучар'                             : [49.9577,40.5019],
    'развязка на Кантемировку'                        : [49.9134,40.5205],
    'развязка на Россошь 2'                           : [49.7569,39.8505],
    'выезд из Воронежа в западном направлении'        : [51.5920,39.2509],
    'выезд из Воронежа в юго-западном направлении'    : [51.6483,39.1005],
    'развязка на Семилуки'                            : [51.6524,39.0432],
    'развязка на Россошь - Острогожск - Кантемировку' : [51.6333,38.9933],
    'развязка на Хохол 1'                             : [51.6475,38.7884],
    'развязка на Нижнедевицк'                         : [51.5648,38.3650],
    'развязка на Хохол 2'                             : [51.5319,38.9694],
    'развязка на Нововоронеж'                         : [51.3408,39.0237],
    'развязка на Репьёвку'                            : [51.0492,38.9838],
    'развязка на Россошь 3'                           : [50.9037,39.0670]
};

// Оформление обычной и выделенной конечных точек маршрута
var endPointsUnchecked = 'islands#redCircleIcon';
var endPointsChecked   = 'islands#redCircleDotIcon';

// Массив конечных точек маршрута
var routeEndPoints = {
    'Рамонь'        : [51.9130,39.3365],
    'Верхняя Хава'  : [51.8422,39.9556],
    'Панино'        : [51.6516,40.1355],
    'Эртиль'        : [51.8325,40.8052],
    'Терновка'      : [51.6864,41.5907],
    'Новая Усмань'  : [51.6480,39.4101],
    'Анна'          : [51.4729,40.4358],
    'Грибановский'  : [51.4565,41.9726],
    'Борисоглебск'  : [51.3593,42.1180],
    'Поворино'      : [51.1969,42.2589],
    'Каширское'     : [51.4113,39.5906],
    'Бобров'        : [51.1048,40.0246],
    'Таловая'       : [51.1193,40.7252],
    'Новохопёрск'   : [51.0927,41.6253],
    'Лиски'         : [50.9822,39.5125],
    'Бутурлиновка'  : [50.8253,40.5836],
    'Воробьёвка'    : [50.6429,40.9487],
    'Каменка'       : [50.7114,39.4263],
    'Подгоренский'  : [50.4098,39.6435],
    'Павловск'      : [50.4541,40.1248],
    'Калач'         : [50.4206,41.0286],
    'Ольховатка'    : [50.2855,39.2786],
    'Россошь'       : [50.1964,39.5729],
    'Верхний Мамон' : [50.1655,40.3820],
    'Петропавловка' : [50.0887,40.8966],
    'Богучар'       : [49.9379,40.5599],
    'Кантемировка'  : [49.6979,39.8490],
    'Нововоронеж'   : [51.3028,39.2240],
    'Семилуки'      : [51.6919,39.0247],
    'Нижнедевицк'   : [51.5416,38.3655],
    'Хохольский'    : [51.5732,38.7827],
    'Репьёвка '     : [51.0784,38.6419],
    'Острогожск'    : [50.8597,39.0866]
};
